auto_backlog/back_end/app/controllers/fdoc_t_ticket_controller.rb

  def index
    @ary_param = params[:mile_stone].split('-')
    time = Time.now.strftime("%Y-%m-%d").to_s
    @tickets = FdocTTicket.select(:tik_i_trac_id, :tik_v_field_summary)
    .where(
      tik_i_pro_id: params[:pro_id],
      tik_i_field_milestone: @ary_param,
      tik_i_status: params[:status]
    ).where('tik_dt_updt LIKE ?', "%#{time}%").where.not(tik_i_trac_id: nil)
---
SELECT `fdoc_t_ticket`.`tik_i_trac_id`, `fdoc_t_ticket`.`tik_v_field_summary` FROM `fdoc_t_ticket` WHERE `fdoc_t_ticket`.`tik_i_pro_id` = 152 AND `fdoc_t_ticket`.`tik_i_field_milestone` = 2159 AND `fdoc_t_ticket`.`tik_i_status` = 307 AND `fdoc_t_ticket`.`tik_i_trac_id` IS NOT NULL

  def notify_update
    @trac_update_ids = params[:trac_id].split('-')
    @tickets = FdocTTicket.select(:tik_i_trac_id, :tik_v_field_summary)
    .where(tik_i_trac_id: @trac_update_ids).order(:tik_i_trac_id => 'ASC')
---
SELECT `fdoc_t_ticket`.`tik_i_trac_id`, `fdoc_t_ticket`.`tik_v_field_summary` FROM `fdoc_t_ticket` WHERE `fdoc_t_ticket`.`tik_i_trac_id` IN (19087, 19090, 19096) ORDER BY `fdoc_t_ticket`.`tik_i_trac_id` ASC